
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/14954534835)



<pre><code>Apply complete! Resources: 0 added, 4 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.http.my_file: Reading...
cloudflare_zero_trust_tunnel_cloudflared.gate: Refreshing state... [id=25367332-dec7-40f7-afff-0d97c8a68f3a]
cloudflare_zone.xvx_cz: Refreshing state... [id=b84174cc7be41b21a9c36d62aff39e84]
cloudflare_zone.ruzicka_dev: Refreshing state... [id=452e45a673326608122e759793a713f3]
cloudflare_zero_trust_access_tag.tags["wifi"]: Refreshing state... [id=wifi]
cloudflare_zone.mylabs_dev: Refreshing state... [id=2859c4d6f599a36a424765646b79904e]
cloudflare_zero_trust_access_identity_provider.google_oauth: Refreshing state... [id=1a36ca86-d5c6-4e00-b003-006e2034fff3]
cloudflare_zero_trust_access_tag.tags["lan"]: Refreshing state... [id=lan]
cloudflare_zero_trust_access_tag.tags["iot"]: Refreshing state... [id=iot]
cloudflare_zero_trust_access_policy.google_sso_access: Refreshing state... [id=2c8404fb-81ca-4bab-835f-b933c0649e90]
data.http.my_file: Read complete after 0s [id=https://uptimerobot.com/inc/files/ips/IPv4andIPv6.txt]
cloudflare_zero_trust_list.uptimerobot_ips: Refreshing state... [id=45069e77-095c-462c-86d7-98fa9731a0da]
cloudflare_zero_trust_tunnel_cloudflared_config.gate: Refreshing state... [id=25367332-dec7-40f7-afff-0d97c8a68f3a]
cloudflare_dns_record.cname_www_ruzickovabozena_xvx_cz: Refreshing state... [id=74c6f605b8e3bdadda60e83b1072da46]
cloudflare_dns_record.cname_kodi_rpi_xvx_cz: Refreshing state... [id=111f4a3922415708f1abc07c41daa081]
cloudflare_dns_record.cname_uzg_01_xvx_cz: Refreshing state... [id=08cc60e4152df6e4f84d11031d29bf83]
cloudflare_dns_record.mx5_xvx_cz: Refreshing state... [id=5aa6aab8b2b89bebf1907dc080e058b5]
cloudflare_dns_record.cname_gate_xvx_cz: Refreshing state... [id=d401cd09a3dc60e26881209b3fd2094e]
cloudflare_dns_record.cname_uzg_01_2_xvx_cz: Refreshing state... [id=077cb9eeefc680e5542c39bdf408618e]
cloudflare_dns_record.mx2_xvx_cz: Refreshing state... [id=f0b0eafd0d4dbe89a2e5130ed376afcf]
cloudflare_dns_record.cname_gate_ssh_xvx_cz: Refreshing state... [id=aa7621acb99d6a8bf4bddd8fcb8881c5]
cloudflare_dns_record.txt_spf1_xvx_cz: Refreshing state... [id=06890237b2511496df6878acb9824f33]
cloudflare_dns_record.mx4_xvx_cz: Refreshing state... [id=1f909e273d7f77cb8d2ade9c2b33f5a8]
cloudflare_dns_record.cname_svatba_xvx_cz: Refreshing state... [id=6deb708f40e8cdc44af9f26214041d50]
cloudflare_dns_record.cname_www_linux_old_xvx_cz: Refreshing state... [id=4a810c020747f52c0e5638fb16034770]
cloudflare_dns_record.txt_dmarc1_dmarc_xvx_cz: Refreshing state... [id=2ec53d109d14c8bb15fb8dcaced94292]
cloudflare_dns_record.cname_rpi_xvx_cz: Refreshing state... [id=2a528d96927361d0b36eb45a0bd967a9]
cloudflare_dns_record.cname_esphome_rpi_xvx_cz: Refreshing state... [id=d0abbb8e26a6815d285126acd9aa6ac4]
cloudflare_dns_record.a_raspi_xvx_cz: Refreshing state... [id=42b1926b3be431f1d598085c32193eca]
cloudflare_dns_record.cname_zigbee2mqtt_rpi_xvx_cz: Refreshing state... [id=a390a6c185f97d234f5dae8146417fce]
cloudflare_dns_record.cname_www_linux_xvx_cz: Refreshing state... [id=7a420cfcd4e1d79d95988c348ee138f7]
cloudflare_dns_record.cname_petr_xvx_cz: Refreshing state... [id=7d211321aa14c8b2bb46b5884370bb0d]
cloudflare_dns_record.cname_xvx_cz: Refreshing state... [id=129f72a534e70fdde7f7b0d0d8de09f8]
cloudflare_dns_record.txt_google_site_verification_xvx_cz: Refreshing state... [id=d3dec2add7b745e8ad95b9dde7ec4692]
cloudflare_dns_record.cname_www_xvx_cz: Refreshing state... [id=c7fb0d86b11373cd9cde58aa1ae5a789]
cloudflare_dns_record.cname_ruzickovabozena_xvx_cz: Refreshing state... [id=2dd46a0ff555377bb1ca39e2294e2734]
cloudflare_dns_record.cname_linux_xvx_cz: Refreshing state... [id=5df4b6886b43d1d615360f3bab861527]
cloudflare_dns_record.cname_linux_old_xvx_cz: Refreshing state... [id=15fb100a9e230402aa1c86f3d58efe9e]
cloudflare_dns_record.cname_byt_xvx_cz: Refreshing state... [id=4ec0db0c0a3324765b5d8909e6edba5f]
cloudflare_dns_record.cname_hass_rpi_xvx_cz: Refreshing state... [id=f785684417681cdefe2c5facd7bf5faa]
cloudflare_dns_record.cname_prometheus_rpi_xvx_cz: Refreshing state... [id=02b555b7c78e5c97cd356b2c34ae15e5]
cloudflare_dns_record.mx3_xvx_cz: Refreshing state... [id=3b89d2aec9feac9aaf4f591f6dc38587]
cloudflare_dns_record.cname_cestovani_xvx_cz: Refreshing state... [id=13762e91a934735c093cd338d3f9b577]
cloudflare_dns_record.cname_www_svatba_xvx_cz: Refreshing state... [id=1c9fcf3f9970c7205ac0866edfd967f3]
cloudflare_dns_record.cname_rpi_ssh_xvx_cz: Refreshing state... [id=8efd994ff69abfcb270dd308e3438f20]
cloudflare_dns_record.cname_transmission_xvx_cz: Refreshing state... [id=b057f46a71fc1081b09ef0d377a02d39]
cloudflare_dns_record.a_gate_bracha_xvx_cz: Refreshing state... [id=9be04858272f22620ad1b27cd7b5f76e]
cloudflare_dns_record.txt_dkim1_google_domainkey_xvx_cz: Refreshing state... [id=7a6aca074c2c843300481dd24b367db9]
cloudflare_dns_record.cname_msr_2_xvx_cz: Refreshing state... [id=dd9087ccd26e425a4d3414bc8aa486c9]
cloudflare_dns_record.txt_acme_challenge_auth_infra_xvx_cz: Refreshing state... [id=266ba9c4df2471841c54dc3cec8821a5]
cloudflare_dns_record.a_stats_xvx_cz: Refreshing state... [id=b90204c8ccf0315cbf61a258dc06c2e3]
cloudflare_dns_record.cname_grafana_rpi_xvx_cz: Refreshing state... [id=3907d43bb20ae6e80ef5387ca9df0005]
cloudflare_dns_record.cname_alloy_rpi_xvx_cz: Refreshing state... [id=fe0ebe98a1d07a251d6b2dbddf044746]
cloudflare_dns_record.mx1_xvx_cz: Refreshing state... [id=088cef876698a0ddcbca2026a21bfd95]
cloudflare_dns_record.cname_cadvisor_rpi_xvx_cz: Refreshing state... [id=bd354be8c30144e421e3290fee4a4c50]
cloudflare_dns_record.cname_ruzicka_dev: Refreshing state... [id=6012deab4c329d17d2c64685ab381aa1]
cloudflare_dns_record.cname_blog_ruzicka_dev: Refreshing state... [id=40b2f2c58767f934a85dd09857036003]
cloudflare_dns_record.cname_stats_ruzickap_github_io_ruzicka_dev: Refreshing state... [id=4e6ec427d1f22a61d21b3e6e401d9475]
cloudflare_dns_record.cname_petr_ruzicka_dev: Refreshing state... [id=560582f3686f60730649302acc4a54f6]
cloudflare_dns_record.mx2_ruzicka_dev: Refreshing state... [id=998e7ce6783759477c42e79b700f2a2b]
cloudflare_dns_record.mx3_ruzicka_dev: Refreshing state... [id=dc2ccc3ddf800440e8cb36b2750628ff]
cloudflare_dns_record.txt_cf2024_1_domainkey_ruzicka_dev: Refreshing state... [id=a21bd05ef17e1277f9f0ec1756b8f320]
cloudflare_dns_record.spf_txt_ruzicka_dev: Refreshing state... [id=37c6dd1d4f442313753b992ef048ab84]
cloudflare_dns_record.txt_github_pages_challenge_ruzickap_ruzicka_dev: Refreshing state... [id=3278fdec9a5bee7946a9d4cd65dc7645]
cloudflare_dns_record.mx1_ruzicka_dev: Refreshing state... [id=72c3096bb3dfbbea638b11ec6a9084f1]
cloudflare_dns_record.cname_www_ruzicka_dev: Refreshing state... [id=54daa51645ec0c8268be734d23ff39ea]
cloudflare_dns_record.ns3_k8s_mylabs_dev: Refreshing state... [id=8409985e399eb9ff87bb26e9663b8903]
cloudflare_dns_record.cname_www_mylabs_dev: Refreshing state... [id=d3feaa152c14f6f38c69d384ba4f5111]
cloudflare_dns_record.ns1_k8s_mylabs_dev: Refreshing state... [id=bb4675cb0c3a2fcb29cec8d26a466d54]
cloudflare_dns_record.ns3_aws_mylabs_dev: Refreshing state... [id=d207b2188295decc79b025a03bbd5928]
cloudflare_dns_record.ns2_k8s_mylabs_dev: Refreshing state... [id=735395882005c878dfcfdaa0fc3c0b4a]
cloudflare_dns_record.ns4_k8s_mylabs_dev: Refreshing state... [id=edeb28878e93de06491a321036737864]
cloudflare_dns_record.ns2_aws_mylabs_dev: Refreshing state... [id=c09981c61ebf3756ff5f717ced460d7c]
cloudflare_dns_record.mx2_mylabs_dev: Refreshing state... [id=3224096c7ca0547917f9c0026aa65f88]
cloudflare_dns_record.ns1_aws_mylabs_dev: Refreshing state... [id=fdb99a821d84d9685861804054b04cf9]
cloudflare_dns_record.mx3_mylabs_dev: Refreshing state... [id=54c0a1c1eca296a1e1449ef5300fe3d2]
cloudflare_dns_record.cname_mylabs_dev: Refreshing state... [id=512175704937e92cfc53a4711bcfba1a]
cloudflare_dns_record.mx1_mylabs_dev: Refreshing state... [id=83cf9c058c96fce13afbf648b00891a5]
cloudflare_dns_record.spf_txt_mylabs_dev: Refreshing state... [id=12b0353211ea68f2e01d41c96582087a]
cloudflare_dns_record.ns4_aws_mylabs_dev: Refreshing state... [id=9bdfd9d4ad07b2946910408a7abbf540]
cloudflare_dns_record.txt_cf2024_1_domainkey_mylabs_dev: Refreshing state... [id=8820748f17e5b98fb90dd2caf4b51711]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Refreshing state... [id=afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77]
cloudflare_zero_trust_access_application.uzg-01: Refreshing state... [id=beaf53ae-eda1-4aaa-9a97-6e57e1a1d00f]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # cloudflare_zero_trust_access_application.uzg-01 will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "uzg-01" {
      - allowed_idps                 = [] -> null
      ~ aud                          = "ef45dd1862334a61ce4331a36005ec07f238d1e35d80f4cbc3210e6b06840897" -> (known after apply)
      ~ created_at                   = "2025-05-11T09:19:48Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "uzg-01-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "beaf53ae-eda1-4aaa-9a97-6e57e1a1d00f"
      + landing_page_design          = (known after apply)
      ~ logo_url                     = "https://raw.githubusercontent.com/ApolloAutomation/docs/7c110c74481441d464acffb3785c5e6c75230944/docs/assets/favicon.png" -> "https://avatars.githubusercontent.com/u/5508130?v=4.png"
        name                         = "uzg-01-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "uzg-01-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "iot",
          + "lan",
        ]
      ~ updated_at                   = "2025-05-11T09:31:42Z" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_identity_provider.google_oauth will be updated in-place
  ~ resource "cloudflare_zero_trust_access_identity_provider" "google_oauth" {
      ~ config      = {
          + client_secret = (sensitive value)
          ~ redirect_url  = "https://xvxcz.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        id          = "1a36ca86-d5c6-4e00-b003-006e2034fff3"
        name        = "My Test Google IDP - 2"
      ~ scim_config = {
          ~ enabled                  = false -> (known after apply)
          + identity_update_behavior = (known after apply)
          + scim_base_url            = (known after apply)
          ~ seat_deprovision         = false -> (known after apply)
          + secret                   = (sensitive value)
          ~ user_deprovision         = false -> (known after apply)
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.google_sso_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "google_sso_access" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-05-10T06:44:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "2c8404fb-81ca-4bab-835f-b933c0649e90"
        name             = "Google SSO Access - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-11T09:31:41Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.uptimerobot_direct_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "uptimerobot_direct_access" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-05-10T06:44:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
        name             = "UptimeRobot Direct Access - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-11T09:31:41Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
cloudflare_zero_trust_access_identity_provider.google_oauth: Modifying... [id=1a36ca86-d5c6-4e00-b003-006e2034fff3]
cloudflare_zero_trust_access_policy.google_sso_access: Modifying... [id=2c8404fb-81ca-4bab-835f-b933c0649e90]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Modifying... [id=afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77]
cloudflare_zero_trust_access_identity_provider.google_oauth: Modifications complete after 0s [id=1a36ca86-d5c6-4e00-b003-006e2034fff3]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Modifications complete after 1s [id=afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77]
cloudflare_zero_trust_access_policy.google_sso_access: Modifications complete after 5s [id=2c8404fb-81ca-4bab-835f-b933c0649e90]
cloudflare_zero_trust_access_application.uzg-01: Modifying... [id=beaf53ae-eda1-4aaa-9a97-6e57e1a1d00f]
cloudflare_zero_trust_access_application.uzg-01: Modifications complete after 1s [id=beaf53ae-eda1-4aaa-9a97-6e57e1a1d00f]

Apply complete! Resources: 0 added, 4 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"tofu-cloudflare","PRNumber":193,"Program":"tfcmt","SHA1":"c92e943190df576fbd60dc1ab7d0e2b037bb49e5","Vars":{},"WorkflowName":"tofu-cloudflare"} -->